//5位运动员参加了比赛，有人让他们猜测结果
//a选手说：b第二，我第三
//b选手说：我第二，e第四
//c选手说：我第一，d第二
//d选手说：c最后，我第三
//e选手说：我第四，a第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛名次：
int main()
{
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)
					{
						if (((b == 2) + (a == 3) == 1)&&
							((b == 2) + (e == 4) == 1)&&
							((c == 1) + (d == 2) == 1)&&
							((c == 5) + (d == 3) == 1)&&
							((e == 4) + (a == 1) == 1))
						{
							if (a*b*c*d*e == 120)
								printf("a=%d b=%d c=%d d=%d e=%d\n", a, b, c, d, e);
						}
					}
				}
			}
		}
	}
	return 0;
}
